import React from "react";
import {
  Button,
  Badge,
  Dialog,
  Colorpicker,
  Highlight,
} from "react-ts-sook-ui";
import "react-ts-sook-ui/dist/style.css";
const Tester = () => {
  return (
    <section>
      <Button onClick={() => setIsOpen(true)} text="SOOK BUTTON" />
      <Badge theme="success" text="SOOK BADGE" />
      <Badge theme="warning" size="sm" text="SOOK BADGE SM" />{" "}
      <Badge size="md" text="SOOK BADGE MD" />{" "}
      <Badge theme="error" size="lg" text="SOOK BADGE LG" />
      <Colorpicker theme="light" />
      <Highlight theme="error" text="hihihihlaksdfjlaksdjflk"></Highlight>
      {isOpen && (
        <Dialog
          size="lg"
          isXIcon={false}
          //isFixedButton={false}
          handleClosePopup={() => setIsOpen(false)}
          handleConfirmPopup={() => setIsOpen(false)}
          title={
            "다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다"
          }
        >
          <h1>
            다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다
          </h1>
          <h2>
            다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다
          </h2>
          <p>
            다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다
            다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다
            다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다
            다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다다이얼로그열렸다
          </p>
        </Dialog>
      )}
    </section>
  );
};

export default Tester;
